Repository: 0xnurl/site
Catalog: locales/*/messages.po
Languages: fr

# header.subtitle
source: [en] please don't say just hello in chat
fr: [fr] please don't say just hello in chat

# header.introduction
source: [en] Imagine calling someone on the phone, going _hello!_ then putting them on hold... 🤦‍♀️
fr: [fr] Imagine calling someone on the phone, going _hello!_ then putting them on hold... 🤦‍♀️

# example.character.neutral.name
source: [en] Tim
fr: [fr] Tim

# example.character.neutral.avatar-description
source: [en] Tim's Slack avatar
fr: [fr] Tim's Slack avatar

# example.character.bad.name
source: [en] Keith
fr: [fr] Keith

# example.character.bad.avatar-description
source: [en] Keith's Slack avatar
fr: [fr] Keith's Slack avatar

# example.character.good.name
source: [en] Dawn
fr: [fr] Dawn

# example.character.good.avatar-description
source: [en] Dawn's Slack avatar
fr: [fr] Dawn's Slack avatar

# example.bad.title
source: [en] ❌ Don't do this
fr: [fr] ❌ Don't do this

# example.bad.body
source: [en] Note that Keith could have got his answer minutes sooner, and needn't have kept Tim waiting. In fact, Tim could have started thinking about the question right away! People who do this are generally trying to be polite by not jumping right into the request, like one would in person or on the phone - and that's great! But it's [year]not 1990[/year] and chat is neither of those things. For most people, typing is much slower than talking. So despite best intentions, **you're actually just making the other person wait** for you to phrase your question, which is lost productivity (and kinda annoying). The same goes for: - "Hello, are you around?" - "hi sophie - quick question." - "You got a sec?" - "yt?" - "ping" - etc. **Just ask the question!** 😫
fr: [fr] Note that Keith could have got his answer minutes sooner, and needn't have kept Tim waiting. In fact, Tim could have started thinking about the question right away! People who do this are generally trying to be polite by not jumping right into the request, like one would in person or on the phone - and that's great! But it's [year]not 1990[/year] and chat is neither of those things. For most people, typing is much slower than talking. So despite best intentions, **you're actually just making the other person wait** for you to phrase your question, which is lost productivity (and kinda annoying). The same goes for: - "Hello, are you around?" - "hi sophie - quick question." - "You got a sec?" - "yt?" - "ping" - etc. **Just ask the question!** 😫

# example.bad.message1.timestamp
source: [en] 2:15 PM
fr: [fr] 2:15 PM

# example.bad.message1.body
source: [en] hi
fr: [fr] hi

# example.bad.reply1.timestamp
source: [en] 2:19 PM
fr: [fr] 2:19 PM

# example.bad.reply1.body
source: [en] ...?
fr: [fr] ...?

# example.bad.message2.timestamp
source: [en] 2:20 PM
fr: [fr] 2:20 PM

# example.bad.message2.body
source: [en] what time was taht thing again?
fr: [fr] what time was taht thing again?

# example.bad.reply2.timestamp
source: [en] 2:20 PM
fr: [fr] 2:20 PM

# example.bad.reply2.body
source: [en] oh - 3:30 mate
fr: [fr] oh - 3:30 mate

# example.good.title
source: [en] ✅ Instead try this
fr: [fr] ✅ Instead try this

# example.good.body
source: [en] If you feel it's a bit brusque to simply say "Hi" and ask the question, **you can still preface your message with as many pleasantries as you see fit.** For example: - "hey man, what's up? also, any idea when that thing's due?" - "Hi there! Hope you're well. I'm after the latest deck, when you get a sec :)" - "hey, if you're not busy, could you update those NFRs?" - etc. It may seem trivial, but asking your question before getting that initial salutatory reply also allows for **asynchronous communication**. If the other party is away, and you leave before they come back, they can still answer your question, instead of just staring at a "Hello" and wondering what they missed. When done right - everyone's happy! 🎉
fr: [fr] If you feel it's a bit brusque to simply say "Hi" and ask the question, **you can still preface your message with as many pleasantries as you see fit.** For example: - "hey man, what's up? also, any idea when that thing's due?" - "Hi there! Hope you're well. I'm after the latest deck, when you get a sec :)" - "hey, if you're not busy, could you update those NFRs?" - etc. It may seem trivial, but asking your question before getting that initial salutatory reply also allows for **asynchronous communication**. If the other party is away, and you leave before they come back, they can still answer your question, instead of just staring at a "Hello" and wondering what they missed. When done right - everyone's happy! 🎉

# example.good.message1.timestamp
source: [en] 2:15 PM
fr: [fr] 2:15 PM

# example.good.message1.body
source: [en] Hiya! What time was that thing?
fr: [fr] Hiya! What time was that thing?

# example.good.reply1.timestamp
source: [en] 2:15 PM
fr: [fr] 2:15 PM

# example.good.reply1.body
source: [en] hey, 3:30
fr: [fr] hey, 3:30

# example.good.message2.timestamp
source: [en] 2:15 PM
fr: [fr] 2:15 PM

# example.good.message2.body
source: [en] Ta - seeya then!
fr: [fr] Ta - seeya then!

# example.good.reply2.timestamp
source: [en] 2:16 PM
fr: [fr] 2:16 PM

# example.good.reply2.body
source: [en] 👌 np
fr: [fr] 👌 np

# footer.note
source: [en] This is kinda only half serious (kinda 👀) so please don't get [mad](https://www.youtube.com/watch?v=xzpndHtdl9A) at the person who sent you here.
fr: [fr] This is kinda only half serious (kinda 👀) so please don't get [mad](https://www.youtube.com/watch?v=xzpndHtdl9A) at the person who sent you here.

# footer.warning
source: [en] That said, if you see this sites URL as someone's status/bio, be prepared to be ignored if you only say "Hello!"
fr: [fr] That said, if you see this sites URL as someone's status/bio, be prepared to be ignored if you only say "Hello!"

# footer.thanks
source: [en] Based on the wonderful [nohello.com](https://web.archive.org/web/20131127020115/http://www.nohello.com/). Avatars taken from *[The Office](https://en.wikipedia.org/wiki/The_Office_(British_TV_series))*. Open-source on [GitHub](https://github.com/nohello-net/nohello-net.github.io).
fr: [fr] Based on the wonderful [nohello.com](https://web.archive.org/web/20131127020115/http://www.nohello.com/). Avatars taken from *[The Office](https://en.wikipedia.org/wiki/The_Office_(British_TV_series))*. Open-source on [GitHub](https://github.com/nohello-net/nohello-net.github.io).
